from download import download, delete_pages
from parse import parse

service_list = ['ecs', 'vpc', 'evs', 'cce', 'ims', 'eip', 'iam', 'ces']
api_list = [
    # ECS能力群
    "创建云服务器",
    "创建云服务器（按需）",
    "删除云服务器",
    "查询云服务器详情",
    "查询云服务器详情列表",
    "查询云服务器列表",
    "修改云服务器",
    "冷迁移云服务器",
    "批量启动云服务器",
    "批量关闭云服务器",
    "批量重启云服务器",
    "查询弹性云服务器单个磁盘信息",
    "查询弹性云服务器挂载磁盘列表信息",
    "查询弹性云服务器挂载磁盘列表详情信息",
    "弹性云服务器挂载磁盘",
    "弹性云服务器卸载磁盘",
    "修改弹性云服务器挂载的单个磁盘信息",
    "批量添加云服务器网卡",
    "批量删除云服务器网卡",
    "查询云服务器网卡信息",
    "云服务器切换虚拟私有云",
    "更新云服务器指定网卡属性",
    "地域推荐",
    "查询规格详情和规格扩展信息列表",
    "查询规格销售策略",
    "查询云服务器规格变更支持列表",

    # 操作系统管理能力群
    "重装弹性云服务器操作系统（安装Cloud-init）",
    "切换弹性云服务器操作系统（安装Cloud-init）",
    "重装弹性云服务器操作系统（未安装Cloud-init）",
    "切换弹性云服务器操作系统（未安装Cloud-init）",

    # 镜像管理能力群
    "查询镜像列表",
    "更新镜像信息",
    "制作镜像",
    "镜像文件快速导入",
    "使用外部镜像文件制作数据镜像",
    "制作整机镜像",
    "注册镜像",
    "导出镜像",
    "查询镜像支持的OS列表",

    # VPC能力群
    "创建安全组",
    "查询安全组",
    "查询安全组列表",
    "删除安全组",
    "创建安全组规则",
    "查询安全组规则",
    "查询安全组规则列表",
    "删除安全组规则",
    "创建子网",
    "查询子网",
    "查询子网列表",
    "更新子网",
    "删除子网",
    "创建VPC",
    "查询VPC",
    "查询VPC列表",
    "更新VPC",
    "删除VPC",

    # CLUSTER能力群
    "创建集群",
    "删除集群",
    "更新指定的集群",
    "获取指定的集群",
    "集群休眠",
    "集群唤醒",
    "查询指定集群支持配置的参数列表",
    "批量添加指定集群的资源标签",
    "批量删除指定集群的资源标签",
    "变更集群规格",

    # NODE能力群
    "创建节点",
    "获取指定的节点",
    "获取集群下所有节点",
    "更新指定的节点",
    "删除节点",
    "纳管节点",
    "重置节点",
    "同步节点",
    "批量同步节点",
    "创建节点池",
    "获取指定的节点池",
    "获取集群下所有节点池",
    "更新指定节点池",
    "删除节点池",
    "查询指定节点池支持配置的参数列表",
    "查询指定节点池支持配置的参数内容",
    "修改指定节点池配置参数的值",
    "伸缩节点池",
    "同步节点池",
    "节点开启缩容保护",
    "节点关闭缩容保护",

    # 向后兼容
    "变更云服务器规格",
    "查询任务的执行状态",
]
db_file = "api.sqlite"

if __name__ == "__main__":
    download(db_file, service_list)

    parse(db_file, api_list)
    # parse(db_file, ["创建集群"])

    delete_pages(db_file)
